
import math

## fibonachi
fib1 = 0
fib2 = 1
 
n = input("Номер элемента ряда Фибоначчи: ")
n = int(n)
 
i = 0
while i < n:
    fib_sum = 0
    
    fib_sum = fib1 + fib2
    fib1 = fib2
    fib2 = fib_sum
    i = i + 1
    print("Значение этого элемента:", fib_sum)

## string
mapik = {0: ["####","#  #","#  #","#  #","####"],
         1: ["   #","  ##"," # #","   #","   #"],
         2: [" ## ","#  #","  # ","#   ","####"],
         3: ["####","   #","####","   #","####"],
         4: ["#  #","#  #","####","   #","   #"],
         5: ["####","#   ","####","   #","####"],
         6: ["####","#   ","####","#  #","####"],
         7: ["####","   #","   #","   #","   #"],
         8: ["####","#  #","####","#  #","####"],
         9: ["####","#  #","####","   #","####"],
         }

print(mapik.get(0)[0])
n = input("Введите число: ")
i = 0


for i in range(5):
    string = "" 
    for k in range(len(n)):
        string+=(str(mapik.get(int(n[k]))[i])+" ")
    print(string)
